SEAME-pt/Team2_TheySEAME_Rollin/apps/stm32-firmware/test/build/test/mocks/test_mcp2515/mock_stm32u5xx_hal_gpio.h
#define HAL_GPIO_EXTI_Falling_Callback_StubWithCallback HAL_GPIO_EXTI_Falling_Callback_Stub
#define HAL_GPIO_EXTI_Falling_Callback_IgnoreArg_GPIO_Pin() HAL_GPIO_EXTI_Falling_Callback_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_EXTI_Falling_Callback_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_ConfigPinAttributes_IgnoreAndReturn(cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_ConfigPinAttributes requires _Ignore (not AndReturn)");
#define HAL_GPIO_ConfigPinAttributes_Ignore() HAL_GPIO_ConfigPinAttributes_CMockIgnore()
void HAL_GPIO_ConfigPinAttributes_CMockIgnore(void);
#define HAL_GPIO_ConfigPinAttributes_StopIgnore() HAL_GPIO_ConfigPinAttributes_CMockStopIgnore()
void HAL_GPIO_ConfigPinAttributes_CMockStopIgnore(void);
#define HAL_GPIO_ConfigPinAttributes_ExpectAndReturn(GPIOx, GPIO_Pin, PinAttributes, cmock_retval) TEST_FAIL_MESSAGE("HAL_GPIO_ConfigPinAttributes requires _Expect (not AndReturn)");
#define HAL_GPIO_ConfigPinAttributes_Expect(GPIOx, GPIO_Pin, PinAttributes) HAL_GPIO_ConfigPinAttributes_CMockExpect(__LINE__, GPIOx, GPIO_Pin, PinAttributes)
void HAL_GPIO_ConfigPinAttributes_CMockExpect(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint32_t PinAttributes);
typedef void (* CMOCK_HAL_GPIO_ConfigPinAttributes_CALLBACK)(GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint32_t PinAttributes, int cmock_num_calls);
void HAL_GPIO_ConfigPinAttributes_AddCallback(CMOCK_HAL_GPIO_ConfigPinAttributes_CALLBACK Callback);
void HAL_GPIO_ConfigPinAttributes_Stub(CMOCK_HAL_GPIO_ConfigPinAttributes_CALLBACK Callback);
#define HAL_GPIO_ConfigPinAttributes_StubWithCallback HAL_GPIO_ConfigPinAttributes_Stub
#define HAL_GPIO_ConfigPinAttributes_ReturnThruPtr_GPIOx(GPIOx) HAL_GPIO_ConfigPinAttributes_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, sizeof(GPIO_TypeDef))
#define HAL_GPIO_ConfigPinAttributes_ReturnArrayThruPtr_GPIOx(GPIOx, cmock_len) HAL_GPIO_ConfigPinAttributes_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_len * sizeof(*GPIOx)))
#define HAL_GPIO_ConfigPinAttributes_ReturnMemThruPtr_GPIOx(GPIOx, cmock_size) HAL_GPIO_ConfigPinAttributes_CMockReturnMemThruPtr_GPIOx(__LINE__, GPIOx, (cmock_size))
void HAL_GPIO_ConfigPinAttributes_CMockReturnMemThruPtr_GPIOx(UNITY_LINE_TYPE cmock_line, GPIO_TypeDef const* GPIOx, size_t cmock_size);
#define HAL_GPIO_ConfigPinAttributes_IgnoreArg_GPIOx() HAL_GPIO_ConfigPinAttributes_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_ConfigPinAttributes_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_ConfigPinAttributes_IgnoreArg_GPIO_Pin() HAL_GPIO_ConfigPinAttributes_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_ConfigPinAttributes_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_ConfigPinAttributes_IgnoreArg_PinAttributes() HAL_GPIO_ConfigPinAttributes_CMockIgnoreArg_PinAttributes(__LINE__)
void HAL_GPIO_ConfigPinAttributes_CMockIgnoreArg_PinAttributes(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_GetConfigPinAttributes_Ignore() TEST_FAIL_MESSAGE("HAL_GPIO_GetConfigPinAttributes requires _IgnoreAndReturn");
#define HAL_GPIO_GetConfigPinAttributes_IgnoreAndReturn(cmock_retval) HAL_GPIO_GetConfigPinAttributes_CMockIgnoreAndReturn(__LINE__, cmock_retval)
void HAL_GPIO_GetConfigPinAttributes_CMockIgnoreAndReturn(UNITY_LINE_TYPE cmock_line, HAL_StatusTypeDef cmock_to_return);
#define HAL_GPIO_GetConfigPinAttributes_StopIgnore() HAL_GPIO_GetConfigPinAttributes_CMockStopIgnore()
void HAL_GPIO_GetConfigPinAttributes_CMockStopIgnore(void);
#define HAL_GPIO_GetConfigPinAttributes_Expect(GPIOx, GPIO_Pin, pPinAttributes) TEST_FAIL_MESSAGE("HAL_GPIO_GetConfigPinAttributes requires _ExpectAndReturn");
#define HAL_GPIO_GetConfigPinAttributes_ExpectAndReturn(GPIOx, GPIO_Pin, pPinAttributes, cmock_retval) HAL_GPIO_GetConfigPinAttributes_CMockExpectAndReturn(__LINE__, GPIOx, GPIO_Pin, pPinAttributes, cmock_retval)
void HAL_GPIO_GetConfigPinAttributes_CMockExpectAndReturn(UNITY_LINE_TYPE cmock_line, const GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint32_t* pPinAttributes, HAL_StatusTypeDef cmock_to_return);
typedef HAL_StatusTypeDef (* CMOCK_HAL_GPIO_GetConfigPinAttributes_CALLBACK)(const GPIO_TypeDef* GPIOx, uint16_t GPIO_Pin, uint32_t* pPinAttributes, int cmock_num_calls);
void HAL_GPIO_GetConfigPinAttributes_AddCallback(CMOCK_HAL_GPIO_GetConfigPinAttributes_CALLBACK Callback);
void HAL_GPIO_GetConfigPinAttributes_Stub(CMOCK_HAL_GPIO_GetConfigPinAttributes_CALLBACK Callback);
#define HAL_GPIO_GetConfigPinAttributes_StubWithCallback HAL_GPIO_GetConfigPinAttributes_Stub
#define HAL_GPIO_GetConfigPinAttributes_ReturnThruPtr_pPinAttributes(pPinAttributes) HAL_GPIO_GetConfigPinAttributes_CMockReturnMemThruPtr_pPinAttributes(__LINE__, pPinAttributes, sizeof(uint32_t))
#define HAL_GPIO_GetConfigPinAttributes_ReturnArrayThruPtr_pPinAttributes(pPinAttributes, cmock_len) HAL_GPIO_GetConfigPinAttributes_CMockReturnMemThruPtr_pPinAttributes(__LINE__, pPinAttributes, (cmock_len * sizeof(*pPinAttributes)))
#define HAL_GPIO_GetConfigPinAttributes_ReturnMemThruPtr_pPinAttributes(pPinAttributes, cmock_size) HAL_GPIO_GetConfigPinAttributes_CMockReturnMemThruPtr_pPinAttributes(__LINE__, pPinAttributes, (cmock_size))
void HAL_GPIO_GetConfigPinAttributes_CMockReturnMemThruPtr_pPinAttributes(UNITY_LINE_TYPE cmock_line, uint32_t const* pPinAttributes, size_t cmock_size);
#define HAL_GPIO_GetConfigPinAttributes_IgnoreArg_GPIOx() HAL_GPIO_GetConfigPinAttributes_CMockIgnoreArg_GPIOx(__LINE__)
void HAL_GPIO_GetConfigPinAttributes_CMockIgnoreArg_GPIOx(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_GetConfigPinAttributes_IgnoreArg_GPIO_Pin() HAL_GPIO_GetConfigPinAttributes_CMockIgnoreArg_GPIO_Pin(__LINE__)
void HAL_GPIO_GetConfigPinAttributes_CMockIgnoreArg_GPIO_Pin(UNITY_LINE_TYPE cmock_line);
#define HAL_GPIO_GetConfigPinAttributes_IgnoreArg_pPinAttributes() HAL_GPIO_GetConfigPinAttributes_CMockIgnoreArg_pPinAttributes(__LINE__)
void HAL_GPIO_GetConfigPinAttributes_CMockIgnoreArg_pPinAttributes(UNITY_LINE_TYPE cmock_line);

#ifdef __cplusplus
}
#endif

#if defined(__GNUC__) && !defined(__ICC) && !defined(__TMS470__)
#if __GNUC__ > 4 || (__GNUC__ == 4 && (__GNUC_MINOR__ > 6 || (__GNUC_MINOR__ == 6 && __GNUC_PATCHLEVEL__ > 0)))
#pragma GCC diagnostic pop
#endif
#endif

#endif
